Repository: shirokun20/nhasixapp
Catalog: lib/l10n/app_*.arb
Languages: id

source: History Cleanup Service initialized
id: Layanan Pembersihan Riwayat diinisialisasi

source: History Cleanup Service disposed
id: Layanan Pembersihan Riwayat dibuang

# autoCleanupDisabled
source: Auto cleanup history is disabled
id: Pembersihan otomatis riwayat dinonaktifkan

# cleanupServiceStarted
source: Cleanup service started with {intervalHours}h interval
id: Layanan pembersihan dimulai dengan interval {intervalHours} jam

# performingHistoryCleanup
source: Performing history cleanup: {reason}
id: Melakukan pembersihan riwayat: {reason}

# historyCleanupCompleted
source: History cleanup completed: cleared {clearedCount} entries ({reason})
id: Pembersihan riwayat selesai: membersihkan {clearedCount} entri ({reason})

# manualHistoryCleanup
source: Performing manual history cleanup
id: Melakukan pembersihan riwayat manual

# updatedLastAppAccess
source: Updated last app access time
id: Memperbarui waktu akses aplikasi terakhir

source: Updated last cleanup time
id: Memperbarui waktu pembersihan terakhir

# intervalCleanup
source: Interval cleanup ({intervalHours}h)
id: Pembersihan interval ({intervalHours} jam)

# inactivityCleanup
source: Inactivity cleanup ({inactivityDays} days)
id: Pembersihan tidak aktif ({inactivityDays} hari)

# maxAgeCleanup
source: Max age cleanup ({maxDays} days)
id: Pembersihan usia maksimal ({maxDays} hari)

source: Initial cleanup setup
id: Pengaturan pembersihan awal

# shouldCleanupOldHistory
source: Should cleanup old history: {shouldCleanup}
id: Harus membersihkan riwayat lama: {shouldCleanup}

# analyticsMessages
source: Analytics Service Messages
id: Pesan Layanan Analytics

# analyticsServiceInitialized
source: Analytics service initialized - tracking {enabled}
id: Layanan analytics diinisialisasi - pelacakan {enabled}

# analyticsTrackingEnabled
source: Analytics tracking enabled by user
id: Pelacakan analytics diaktifkan oleh pengguna

# analyticsTrackingDisabled
source: Analytics tracking disabled by user - data cleared
id: Pelacakan analytics dinonaktifkan oleh pengguna - data dibersihkan

# analyticsDataCleared
source: Analytics data cleared by user request
id: Data analytics dibersihkan atas permintaan pengguna

source: Analytics service disposed
id: Layanan analytics dibuang

# appStartedEvent
source: App started event tracked
id: Event aplikasi dimulai dilacak

# sessionEndEvent
source: Session end event tracked ({minutes} minutes)
id: Event akhir sesi dilacak ({minutes} menit)

# analyticsEnabledEvent
source: Analytics enabled event tracked
id: Event analytics diaktifkan dilacak

# analyticsDisabledEvent
source: Analytics disabled event tracked
id: Event analytics dinonaktifkan dilacak

# screenViewEvent
source: Screen view tracked: {screenName}
id: Tampilan layar dilacak: {screenName}

# userActionEvent
source: User action tracked: {action}
id: Aksi pengguna dilacak: {action}

# performanceEvent
source: Performance tracked: {operation} ({durationMs}ms)
id: Performa dilacak: {operation} ({durationMs}ms)

# errorEvent
source: Error tracked: {errorType} - {errorMessage}
id: Error dilacak: {errorType} - {errorMessage}

# featureUsageEvent
source: Feature usage tracked: {feature}
id: Penggunaan fitur dilacak: {feature}

# readingSessionEvent
source: Reading session tracked: {contentId} ({minutes}min, {pages} pages)
id: Sesi membaca dilacak: {contentId} ({minutes}mnt, {pages} halaman)

# offlineManagerMessages
source: Offline Content Manager Messages
id: Pesan Manajer Konten Offline

# offlineContentAvailable
source: Content {contentId} is available offline: {available}
id: Konten {contentId} tersedia offline: {available}

# offlineContentPath
source: Offline content path for {contentId}: {path}
id: Path konten offline untuk {contentId}: {path}

# foundExistingFiles
source: Found {count} existing downloaded files
id: Ditemukan {count} file yang sudah diunduh

# offlineImageUrlsFound
source: Found {count} offline image URLs for {contentId}
id: Ditemukan {count} URL gambar offline untuk {contentId}

# offlineContentIdsFound
source: Found {count} offline content IDs
id: Ditemukan {count} ID konten offline

# searchingOfflineContent
source: Searching offline content for: {query}
id: Mencari konten offline untuk: {query}

# offlineContentMetadata
source: Offline content metadata for {contentId}: {source}
id: Metadata konten offline untuk {contentId}: {source}

# offlineContentCreated
source: Offline content created for {contentId}
id: Konten offline dibuat untuk {contentId}

# offlineStorageUsage
source: Offline storage usage: {sizeBytes} bytes
id: Penggunaan penyimpanan offline: {sizeBytes} bytes

# cleanupOrphanedFilesStarted
source: Starting cleanup of orphaned offline files
id: Memulai pembersihan file offline yang yatim piatu

# cleanupOrphanedFilesCompleted
source: Cleanup of orphaned offline files completed
id: Pembersihan file offline yang yatim piatu selesai

# removedOrphanedDirectory
source: Removed orphaned directory: {path}
id: Direktori yatim piatu dihapus: {path}

# queryLabel
source: Query
id: Kueri

# excludeGroupsLabel
source: Exclude Groups
id: Kecualikan Grup

# excludeCharactersLabel
source: Exclude Characters
id: Kecualikan Karakter

# excludeParodiesLabel
source: Exclude Parodies
id: Kecualikan Parodi

# excludeArtistsLabel
source: Exclude Artists
id: Kecualikan Artis

# seconds
source: {count}s
id: {count}d

source: Loading user preferences
id: Memuat preferensi pengguna

source: Successfully loaded user preferences
id: Berhasil memuat preferensi pengguna

# invalidColumnsPortraitValue
source: Invalid columns portrait value: {value}
id: Nilai kolom potret tidak valid: {value}

# invalidColumnsLandscapeValue
source: Invalid columns landscape value: {value}
id: Nilai kolom lanskap tidak valid: {value}

source: Updating settings via PreferencesService
id: Memperbarui pengaturan melalui PreferencesService

source: Successfully updated settings
id: Berhasil memperbarui pengaturan

# failedToUpdateSetting
source: Failed to update setting: {error}
id: Gagal memperbarui pengaturan: {error}

source: Resetting all settings to defaults
id: Mereset semua pengaturan ke default

source: Successfully reset all settings to defaults
id: Berhasil mereset semua pengaturan ke default

source: Settings not loaded
id: Pengaturan tidak dimuat

source: Exporting settings
id: Mengekspor pengaturan

source: Successfully exported settings
id: Berhasil mengekspor pengaturan

# failedToExportSettings
source: Failed to export settings: {error}
id: Gagal mengekspor pengaturan: {error}

source: Importing settings
id: Mengimpor pengaturan

source: Successfully imported settings
id: Berhasil mengimpor pengaturan

# failedToImportSettings
source: Failed to import settings: {error}
id: Gagal mengimpor pengaturan: {error}

# unableToSyncSettings
source: Unable to sync settings. Changes will be saved locally.
id: Tidak dapat menyinkronkan pengaturan. Perubahan akan disimpan secara lokal.

# unableToSaveSettings
source: Unable to save settings. Please check device storage.
id: Tidak dapat menyimpan pengaturan. Silakan periksa penyimpanan perangkat.

# failedToUpdateSettings
source: Failed to update settings. Please try again.
id: Gagal memperbarui pengaturan. Silakan coba lagi.

source: No history found
id: Tidak ada riwayat ditemukan

# loadedHistoryEntries
source: Loaded {count} history entries
id: Memuat {count} entri riwayat

# failedToLoadHistory
source: Failed to load history: {error}
id: Gagal memuat riwayat: {error}

# loadingMoreHistory
source: Loading more history (page {page})
id: Memuat lebih banyak riwayat (halaman {page})

# loadedMoreHistoryEntries
source: Loaded {count} more entries, total: {total}
id: Memuat {count} entri lagi, total: {total}

source: Refreshing history
id: Menyegarkan riwayat

# refreshedHistoryWithEntries
source: Refreshed history with {count} entries
id: Riwayat disegarkan dengan {count} entri

# failedToRefreshHistory
source: Failed to refresh history: {error}
id: Gagal menyegarkan riwayat: {error}

source: Clearing all history
id: Menghapus semua riwayat

source: All history cleared
id: Semua riwayat dihapus

# failedToClearHistory
source: Failed to clear history: {error}
id: Gagal menghapus riwayat: {error}

# removingHistoryItem
source: Removing history item: {contentId}
id: Menghapus item riwayat: {contentId}

# removedHistoryItem
source: Removed history item: {contentId}
id: Item riwayat dihapus: {contentId}

# failedToRemoveHistoryItem
source: Failed to remove history item: {error}
id: Gagal menghapus item riwayat: {error}

source: Performing manual history cleanup
id: Melakukan pembersihan riwayat manual

source: Manual cleanup completed
id: Pembersihan manual selesai

# failedToPerformCleanup
source: Failed to perform cleanup: {error}
id: Gagal melakukan pembersihan: {error}

source: Updating cleanup settings
id: Memperbarui pengaturan pembersihan

source: Cleanup settings updated
id: Pengaturan pembersihan diperbarui

# addingContentToFavorites
source: Adding content to favorites: {title}
id: Menambahkan konten ke favorit: {title}

# successfullyAddedToFavorites
source: Successfully added to favorites: {title}
id: Berhasil ditambahkan ke favorit: {title}

# contentNotInFavorites
source: Content {contentId} is not in favorites, skipping removal
id: Konten {contentId} tidak ada di favorit, melewati penghapusan

# callingRemoveFromFavoritesUseCase
source: Calling removeFromFavoritesUseCase with params: {params}
id: Memanggil removeFromFavoritesUseCase dengan parameter: {params}

source: Successfully called removeFromFavoritesUseCase
id: Berhasil memanggil removeFromFavoritesUseCase

# updatingFavoritesListInState
source: Updating favorites list in state, removing contentId: {contentId}
id: Memperbarui daftar favorit di state, menghapus contentId: {contentId}

# favoritesCountBeforeAfter
source: Favorites count: before={before}, after={after}
id: Jumlah favorit: sebelum={before}, setelah={after}

source: State updated successfully
id: State berhasil diperbarui

# successfullyRemovedFromFavorites
source: Successfully removed from favorites: {contentId}
id: Berhasil dihapus dari favorit: {contentId}

# errorRemovingContentFromFavorites
source: Error removing content {contentId} from favorites: {error}
id: Kesalahan menghapus konten {contentId} dari favorit: {error}

# removingFavoritesInBatch
source: Removing {count} favorites in batch
id: Menghapus {count} favorit dalam batch

# successfullyRemovedFavoritesInBatch
source: Successfully removed {count} favorites in batch
id: Berhasil menghapus {count} favorit dalam batch

# searchingFavoritesWithQuery
source: Searching favorites with query: {query}
id: Mencari favorit dengan query: {query}

# foundFavoritesMatchingQuery
source: Found {count} favorites matching query
id: Ditemukan {count} favorit yang cocok dengan query

source: Clearing favorites search
id: Menghapus pencarian favorit

source: Exporting favorites data
id: Mengekspor data favorit

# successfullyExportedFavorites
source: Successfully exported {count} favorites
id: Berhasil mengekspor {count} favorit

source: Importing favorites data
id: Mengimpor data favorit

# successfullyImportedFavorites
source: Successfully imported {count} favorites
id: Berhasil mengimpor {count} favorit

# failedToImportFavorite
source: Failed to import favorite: {error}
id: Gagal mengimpor favorit: {error}

source: Retrying favorites loading
id: Mencoba lagi memuat favorit

source: Refreshing favorites
id: Menyegarkan favorit

# failedToLoadFavorites
source: Failed to load favorites: {error}
id: Gagal memuat favorit: {error}

# failedToInitializeDownloadManager
source: Failed to initialize download manager: {error}
id: Gagal menginisialisasi manajer unduhan: {error}

# failedToQueueDownload
source: Failed to queue download: {error}
id: Gagal mengantri unduhan: {error}

source: Waiting for WiFi connection
id: Menunggu koneksi WiFi

# retryingDownload
source: Retrying... ({current}/{total})
id: Mencoba lagi... ({current}/{total})

source: Download cancelled by user
id: Unduhan dibatalkan oleh pengguna

# failedToPauseDownload
source: Failed to pause download: {error}
id: Gagal menjeda unduhan: {error}

# failedToCancelDownload
source: Failed to cancel download: {error}
id: Gagal membatalkan unduhan: {error}

# failedToRetryDownload
source: Failed to retry download: {error}
id: Gagal mencoba lagi unduhan: {error}

# failedToResumeDownload
source: Failed to resume download: {error}
id: Gagal melanjutkan unduhan: {error}

# failedToRemoveDownload
source: Failed to remove download: {error}
id: Gagal menghapus unduhan: {error}

# failedToRefreshDownloads
source: Failed to refresh downloads: {error}
id: Gagal menyegarkan unduhan: {error}

# failedToUpdateDownloadSettings
source: Failed to update download settings: {error}
id: Gagal memperbarui pengaturan unduhan: {error}

source: Pausing all downloads
id: Menjeda semua unduhan

source: Resuming all downloads
id: Melanjutkan semua unduhan

source: Cancelling all downloads
id: Membatalkan semua unduhan

source: Clearing completed downloads
id: Menghapus unduhan yang selesai

# failedToPauseAllDownloads
source: Failed to pause all downloads: {error}
id: Gagal menjeda semua unduhan: {error}

# failedToResumeAllDownloads
source: Failed to resume all downloads: {error}
id: Gagal melanjutkan semua unduhan: {error}

# failedToCancelAllDownloads
source: Failed to cancel all downloads: {error}
id: Gagal membatalkan semua unduhan: {error}

# failedToQueueRangeDownload
source: Failed to queue range download: {error}
id: Gagal mengantri unduhan rentang: {error}

# failedToClearCompletedDownloads
source: Failed to clear completed downloads: {error}
id: Gagal menghapus unduhan yang selesai: {error}

# downloadNotCompletedYet
source: Download is not completed yet
id: Unduhan belum selesai

source: No images found for conversion
id: Tidak ada gambar yang ditemukan untuk konversi

# storageCleanupCompleted
source: Storage cleanup completed. Cleaned {cleanedFiles} directories, freed {freedSpace} MB
id: Pembersihan penyimpanan selesai. Membersihkan {cleanedFiles} direktori, membebaskan {freedSpace} MB

# storageCleanupComplete
source: Storage Cleanup Complete: Cleaned {cleanedFiles} items, freed {freedSpace} MB
id: Pembersihan Penyimpanan Selesai: Membersihkan {cleanedFiles} item, membebaskan {freedSpace} MB

# storageCleanupFailed
source: Storage Cleanup Failed: {error}
id: Pembersihan Penyimpanan Gagal: {error}

# exportDownloadsComplete
source: Export Complete: Downloads exported to {fileName}
id: Ekspor Selesai: Unduhan diekspor ke {fileName}

# failedToDeleteDirectory
source: Failed to delete directory: {path}, error: {error}
id: Gagal menghapus direktori: {path}, error: {error}

# failedToDeleteTempFile
source: Failed to delete temp file: {path}, error: {error}
id: Gagal menghapus file temp: {path}, error: {error}

# downloadDirectoryNotFound
source: Download directory not found: {path}
id: Direktori unduhan tidak ditemukan: {path}

# cannotOpenIncompleteDownload
source: Cannot open - download not completed or path missing for {contentId}
id: Tidak dapat membuka - unduhan belum selesai atau path hilang untuk {contentId}

# errorOpeningDownloadedContent
source: Error opening downloaded content: {error}
id: Error membuka konten yang diunduh: {error}

# allStrategiesFailedToOpenDownload
source: All strategies failed to open downloaded content for {contentId}
id: Semua strategi gagal membuka konten yang diunduh untuk {contentId}

# failedToSaveProgressToDatabase
source: Failed to save progress to database: {error}
id: Gagal menyimpan progress ke database: {error}

# failedToUpdatePauseNotification
source: Failed to update pause notification: {error}
id: Gagal memperbarui notifikasi jeda: {error}

# failedToUpdateResumeNotification
source: Failed to update resume notification: {error}
id: Gagal memperbarui notifikasi lanjut: {error}

# failedToUpdateNotificationProgress
source: Failed to update notification progress: {error}
id: Gagal memperbarui progress notifikasi: {error}

# errorCalculatingDirectorySize
source: Error calculating directory size: {error}
id: Error menghitung ukuran direktori: {error}

# errorCleaningTempFiles
source: Error cleaning temp files in: {path}, error: {error}
id: Error membersihkan file temp di: {path}, error: {error}

# errorDetectingDownloadsDirectory
source: Error detecting Downloads directory: {error}
id: Error mendeteksi direktori Downloads: {error}

# usingEmergencyFallbackDirectory
source: Using emergency fallback directory: {path}
id: Menggunakan direktori fallback darurat: {path}

source: Error during storage cleanup
id: Error selama pembersihan penyimpanan

source: Error during export
id: Error selama ekspor

# errorDuringPdfConversion
source: Error during PDF conversion for {contentId}
id: Error selama konversi PDF untuk {contentId}

# errorRetryingPdfConversion
source: Error retrying PDF conversion: {error}
id: Error mencoba lagi konversi PDF: {error}

source: Import Backup Folder
id: Import Folder Backup

# importBackupFolderDescription
source: Enter the path to your backup folder containing nhasix content folders:
id: Masukkan path ke folder backup yang berisi folder konten nhasix:

source: Scanning backup folder...
id: Memindai folder backup...

# backupContentFound
source: Found {count} backup items
id: Ditemukan {count} item backup

# noBackupContentFound
source: No valid content found in backup folder
id: Tidak ada konten valid ditemukan di folder backup

# errorScanningBackup
source: Error scanning backup: {error}
id: Error memindai backup: {error}

# themeDescription
source: Choose your preferred color theme for the app interface.
id: Pilih tema warna yang diinginkan untuk antarmuka aplikasi.

# imageQualityDescription
source: Choose image quality for downloads. Higher quality uses more storage and data.
id: Pilih kualitas gambar untuk unduhan. Kualitas lebih tinggi menggunakan lebih banyak penyimpanan dan data.

# gridColumnsDescription
source: Choose how many columns to display content in portrait mode. More columns show more content but smaller items.
id: Pilih berapa banyak kolom untuk menampilkan konten dalam mode potret. Lebih banyak kolom menampilkan lebih banyak item tetapi lebih kecil.

source: Grid Preview
id: Pratinjau Grid

# autoCleanupDescription
source: Manage automatic cleanup of reading history to free up storage space.
id: Kelola pembersihan otomatis riwayat baca untuk menghemat ruang penyimpanan.

# testCacheClearing
source: Test App Update Cache Clearing
id: Tes Pembersihan Cache Update App

# testCacheClearingDescription
source: Simulate app update and test cache clearing behavior.
id: Simulasikan update aplikasi dan tes perilaku pembersihan cache.

# forceClearCache
source: Force Clear All Caches
id: Paksa Bersihkan Semua Cache

# forceClearCacheDescription
source: Manually clear all image caches.
id: Bersihkan semua cache gambar secara manual.

source: Run Test
id: Jalankan Tes

# clearCacheButton
source: Clear Cache
id: Bersihkan Cache

# disguiseModeDescription
source: Choose how the app appears in your launcher for privacy.
id: Pilih bagaimana aplikasi muncul di launcher Anda untuk privasi.

# applyingDisguiseMode
source: Applying disguise mode changes...
id: Menerapkan perubahan mode penyamaran...

# disguiseCalculator
source: Calculator
id: Kalkulator

# disguiseNotes
source: Notes
id: Catatan

# disguiseWeather
source: Weather
id: Cuaca

# storagePermissionScan
source: Storage permission required to scan backup folders
id: Izin penyimpanan diperlukan untuk memindai folder backup

# syncResult
source: Synced: {synced} new, {updated} updated
id: Disinkronkan: {synced} baru, {updated} diperbarui

source: Exporting Library
id: Mengekspor Perpustakaan

# libraryExportSuccess
source: Library exported successfully!
id: Perpustakaan berhasil diekspor!

# deletingContent
source: Deleting {title}...
id: Menghapus {title}...

# contentDeletedFreed
source: {title} deleted. Freed {size} MB
id: {title} dihapus. Menghemat {size} MB

# failedToDeleteContent
source: Failed to delete {title}
id: Gagal menghapus {title}

source: 🚀 Cache Management (Debug)
id: 🚀 Manajemen Cache (Debug)
