Repository: shirokun20/nhasixapp
Catalog: lib/l10n/app_*.arb
Languages: id

# oneDay
source: 1 day
id: 1 hari

# twoDays
source: 2 days
id: 2 hari

# oneWeek
source: 1 week
id: 1 minggu

# privacyInfoText
source: • Data is stored on your device • Not sent to external servers • Only to improve app performance • Can be disabled anytime
id: • Data disimpan di device Anda • Tidak dikirim ke server eksternal • Hanya untuk meningkatkan performa app • Dapat dimatikan kapan saja

source: Unlimited
id: Tanpa batas

# daysValue
source: {days} days
id: {days} hari

# analyticsSubtitle
source: Helps app development with local data (not shared)
id: Membantu pengembangan app dengan data lokal (tidak dibagikan)

source: Loading Error
id: Kesalahan Memuat

source: Jump to Page
id: Loncat ke Halaman

# pageInputLabel
source: Page (1-{maxPages})
id: Halaman (1-{maxPages})

# pageOfPages
source: Page {current} of {total}
id: Halaman {current} dari {total}

source: Jump
id: Loncat

source: Reader Settings
id: Pengaturan Pembaca

source: Reading Mode
id: Mode Baca

source: Horizontal Pages
id: Halaman Horizontal

source: Vertical Pages
id: Halaman Vertikal

source: Continuous Scroll
id: Gulir Terus Menerus

source: Keep Screen On
id: Jaga Layar Hidup

# keepScreenOnDescription
source: Prevent screen from turning off while reading
id: Mencegah layar mati saat membaca

source: Platform Not Supported
id: Platform Tidak Didukung

# platformNotSupportedBody
source: NhasixApp is designed exclusively for Android devices.
id: Kuron dirancang khusus untuk perangkat Android.

# platformNotSupportedInstall
source: Please install and run this app on an Android device.
id: Silakan pasang dan jalankan aplikasi ini di perangkat Android.

# storagePermissionRequired
source: Storage permission is required for downloads. Please grant storage permission in app settings.
id: Izin penyimpanan diperlukan untuk unduhan. Harap berikan izin penyimpanan di pengaturan aplikasi.

# storagePermissionExplanation
source: This app needs storage permission to download files to your device. Files will be saved to the Downloads/nhasix folder.
id: Aplikasi ini membutuhkan izin penyimpanan untuk mengunduh file ke perangkat Anda. File akan disimpan di folder Downloads/nhasix.

source: Grant Permission
id: Berikan Izin

source: Permission Required
id: Izin Diperlukan

# storagePermissionSettingsPrompt
source: Storage permission is required to download files. Please grant storage permission in app settings.
id: Izin penyimpanan diperlukan untuk mengunduh file. Silakan berikan izin penyimpanan di pengaturan aplikasi.

source: Open Settings
id: Buka Pengaturan

# readingHistoryMessage
source: Your reading history will appear here as you read content.
id: Riwayat bacaan Anda akan muncul di sini saat Anda membaca konten.

source: Start Reading
id: Mulai Membaca

# searchSomethingInteresting
source: Search for something interesting
id: Cari sesuatu yang menarik

source: Check out featured items
id: Lihat item unggulan

# appSubtitleDescription
source: Nhentai unofficial client
id: Klien tidak resmi Nhentai

source: Downloaded galleries
id: Galeri yang diunduh

source: Favorite galleries
id: Galeri favorit

source: View history
id: Lihat riwayat

source: Open in browser
id: Buka di browser

# downloadAllGalleries
source: Download all galleries in this page
id: Unduh semua galeri di halaman ini

# enterPageNumber
source: Enter page number (1 - {totalPages})
id: Masukkan nomor halaman (1 - {totalPages})

source: Page number
id: Nomor halaman

source: Go
id: Pergi

# validPageNumberError
source: Please enter a valid page number between 1 and {totalPages}
id: Silakan masukkan nomor halaman yang valid antara 1 dan {totalPages}

# loadingContentTitle
source: Loading Content
id: Memuat Konten

source: Loading Content Details
id: Memuat Detail Konten

# fetchingMetadata
source: Fetching metadata and images...
id: Mengambil metadata dan gambar...

# thisMayTakeMoments
source: This may take a few moments
id: Ini mungkin memerlukan beberapa saat

# youAreOffline
source: You are offline. Some features may be limited.
id: Anda sedang offline. Beberapa fitur mungkin terbatas.

source: Go Online
id: Buka Online

source: You are offline. Tap to go online.
id: Anda sedang offline. Ketuk untuk online.

source: Content Information
id: Informasi Konten

source: Copy Link
id: Salin Link

source: More Options
id: Opsi Lainnya

source: More Like This
id: Lebih Seperti Ini

source: Statistics
id: Statistik

source: Share Content
id: Bagikan Konten

# sharePanelOpened
source: Share panel opened successfully!
id: Panel berbagi berhasil dibuka!

# shareFailed
source: Share failed, but link copied to clipboard
id: Berbagi gagal, tetapi link telah disalin ke clipboard

# downloadStartedFor
source: Download started for "{title}"
id: Unduhan dimulai untuk "{title}"

# viewDownloadsAction
source: View
id: Lihat

# failedToStartDownload
source: Failed to start download: {error}
id: Gagal memulai unduhan: {error}

source: Link copied to clipboard
id: Link telah disalin ke clipboard

# failedToCopyLink
source: Failed to copy link. Please try again.
id: Gagal menyalin link. Silakan coba lagi.

source: Copied Link
id: Link Disalin

# linkCopiedToClipboardDescription
source: The following link has been copied to your clipboard:
id: Link berikut telah disalin ke clipboard Anda:

# closeDialog
source: Close
id: Tutup

# goOnlineDialogTitle
source: Go Online
id: Buka Online

# goOnlineDialogContent
source: You are currently in offline mode. Would you like to go online to access the latest content?
id: Anda saat ini dalam mode offline. Apakah Anda ingin online untuk mengakses konten terbaru?

source: Going online...
id: Membuka online...

# pagesLabel
source: Pages
id: Halaman

# languageLabel
source: Language
id: Bahasa

# artistLabel
source: Artist
id: Artis

# charactersLabel
source: Characters
id: Karakter

# parodiesLabel
source: Parodies
id: Parodi

# groupsLabel
source: Groups
id: Grup

# uploadedLabel
source: Uploaded
id: Diunggah

# favoritesLabel
source: Favorites
id: Favorit

# tagsLabel
source: Tags
id: Tag

# artistsLabel
source: Artists
id: Artis

# relatedLabel
source: Related
id: Terkait

# yearAgo
source: {count} year{plural} ago
id: {count} tahun{plural} lalu

# monthAgo
source: {count} month{plural} ago
id: {count} bulan{plural} lalu

# dayAgo
source: {count} day{plural} ago
id: {count} hari{plural} lalu

# hourAgo
source: {count} hour{plural} ago
id: {count} jam{plural} lalu

# selectFavoritesTooltip
source: Select favorites
id: Pilih favorit

# deleteSelectedTooltip
source: Delete selected
id: Hapus yang dipilih

# selectAllAction
source: Select All
id: Pilih Semua

# clearAction
source: Clear
id: Bersihkan

# loadingFavoritesMessage
source: Loading favorites...
id: Memuat favorit...

# deletingFavoritesMessage
source: Deleting favorites...
id: Menghapus favorit...

# removingFromFavoritesMessage
source: Removing from favorites...
id: Menghapus dari favorit...

# favoritesDeletedMessage
source: Favorites deleted successfully
id: Favorit berhasil dihapus

# failedToDeleteFavoritesMessage
source: Failed to delete favorites
id: Gagal menghapus favorit

# confirmDeleteFavoritesTitle
source: Delete Favorites
id: Hapus Favorit

# confirmDeleteFavoritesMessage
source: Are you sure you want to delete {count} favorite{plural}?
id: Apakah Anda yakin ingin menghapus {count} favorit?

# exportFavoritesTitle
source: Export Favorites
id: Ekspor Favorit

# exportingFavoritesMessage
source: Exporting favorites...
id: Mengekspor favorit...

# favoritesExportedMessage
source: Favorites exported successfully
id: Favorit berhasil diekspor

# failedToExportFavoritesMessage
source: Failed to export favorites
id: Gagal mengekspor favorit

# searchFavoritesHint
source: Search favorites...
id: Cari favorit...

# searchOfflineContentHint
source: Search offline content...
id: Cari konten offline...

# failedToLoadPage
source: Failed to load page {pageNumber}
id: Gagal memuat halaman {pageNumber}

source: Failed to load
id: Gagal memuat

# loginRequiredForAction
source: Login required for this action
id: Login diperlukan untuk tindakan ini

# offlineContentTitle
source: Offline Content
id: Konten Offline

source: Favorited
id: Difavoritkan

source: Favorite
id: Favorit

# errorLoadingFavoritesTitle
source: Error Loading Favorites
id: Kesalahan Memuat Favorit

# clearAllAction
source: Clear All
id: Bersihkan Semua

# searchFilterHint
source: Search {filterType}...
id: Cari {filterType}...

# selectedCountFormat2
source: Selected ({count})
id: Dipilih ({count})

# errorLoadingFilterDataTitle
source: Error loading filter data
id: Kesalahan memuat data filter

source: Content deleted
id: Konten dihapus

source: Browse Downloads
id: Jelajahi Unduhan

source: No {filterType} available
id: Tidak ada {filterType} tersedia

source: No results found for "{query}"
id: Tidak ada hasil untuk "{query}"

# contentNotFoundTitle
source: Content Not Found
id: Konten Tidak Ditemukan

# contentNotFoundMessage
source: Content with ID "{contentId}" was not found.
id: Konten dengan ID "{contentId}" tidak ditemukan.

# filterCategoriesTitle
source: Filter Categories
id: Kategori Filter

# searchTitle
source: Search
id: Cari

# advancedSearchTitle
source: Advanced Search
id: Pencarian Lanjutan

# enterSearchQueryHint
source: Enter search query (e.g. "big breasts english")
id: Masukkan kata kunci pencarian (contoh: "big breasts english")

# popularSearchesTitle
source: Popular Searches
id: Pencarian Populer

# recentSearchesTitle
source: Recent Searches
id: Pencarian Terbaru

# pressSearchButtonMessage
source: Press the Search button to find content with your current filters
id: Tekan tombol Cari untuk menemukan konten dengan filter saat ini

# searchingMessage
source: Searching...
id: Mencari...

# resultsCountFormat
source: {count} results
id: {count} hasil

# viewInMainAction
source: View in Main
id: Lihat di Utama

# searchErrorTitle
source: Search Error
id: Kesalahan Pencarian

# noResultsFoundTitle
source: No results found
id: Tidak ada hasil

# pageText
source: page {pageNumber}
id: halaman {pageNumber}

# pagesText
source: pages {startPage}-{endPage}
id: halaman {startPage}-{endPage}

# errorOccurred
source: An error occurred
id: Terjadi kesalahan

source: Tap to retry
id: Ketuk untuk mencoba lagi

# helpTitle
source: Help
id: Bantuan

# helpNoResults
source: No results found for your search
id: Tidak ada hasil ditemukan untuk pencarian Anda

# helpTryDifferent
source: Try using different keywords or check your spelling
id: Coba gunakan kata kunci yang berbeda atau periksa ejaan

# helpUseFilters
source: Use filters to narrow down your search
id: Gunakan filter untuk mempersempit pencarian

# helpCheckConnection
source: Check your internet connection
id: Periksa koneksi internet Anda

# sendReportText
source: Send Report
id: Kirim Laporan

# technicalDetailsTitle
source: Technical Details
id: Detail Teknis

# reportSentText
source: Report sent!
id: Laporan terkirim!

# suggestionCheckConnection
source: Check your internet connection
id: Periksa koneksi internet Anda

# suggestionTryWifiMobile
source: Try switching between WiFi and mobile data
id: Coba beralih antara WiFi dan data seluler

# suggestionRestartRouter
source: Restart your router if using WiFi
id: Restart router jika menggunakan WiFi

# suggestionCheckWebsite
source: Check if the website is down
id: Periksa apakah situs web sedang down

# noContentFoundWithQuery
source: No content found for "{query}". Try adjusting your search terms or filters.
id: Tidak ada konten ditemukan untuk "{query}". Coba sesuaikan istilah pencarian atau filter.

# noContentFound
source: No content found. Try adjusting your search terms or filters.
id: Tidak ada konten ditemukan. Coba sesuaikan istilah pencarian atau filter.

# suggestionTryDifferentKeywords
source: Try different keywords
id: Coba kata kunci yang berbeda

# suggestionRemoveFilters
source: Remove some filters
id: Hapus beberapa filter

# suggestionCheckSpelling
source: Check spelling
id: Periksa ejaan

# suggestionUseBroaderTerms
source: Use broader search terms
id: Gunakan istilah pencarian yang lebih luas

# underMaintenanceTitle
source: Under Maintenance
id: Sedang Maintenance

# underMaintenanceMessage
source: The service is currently under maintenance. Please check back later.
id: Layanan sedang dalam pemeliharaan. Silakan coba lagi nanti.

# suggestionMaintenanceHours
source: Maintenance usually takes a few hours
id: Maintenance biasanya memakan waktu beberapa jam

# suggestionCheckSocial
source: Check social media for updates
id: Periksa media sosial untuk update

# suggestionTryLater
source: Try again later
id: Coba lagi nanti

# includeFilter
source: Include
id: Sertakan

# excludeFilter
source: Exclude
id: Kecualikan

source: Overall Progress
id: Progress Keseluruhan

source: Done
id: Selesai

# downloadsFailed
source: {count} download{plural} failed
id: {count} unduhan gagal

source: Processing...
id: Memproses...

# readingCompleted
source: Completed
id: Selesai

source: Read Again
id: Baca Lagi

source: Continue Reading
id: Lanjutkan Membaca

# lessThanOneMinute
source: Less than 1 minute
id: Kurang dari 1 menit

source: reading time
id: waktu baca

source: Download Actions
id: Tindakan Download

source: Pause
id: Jeda

source: Convert to PDF
id: Konversi ke PDF

source: Details
id: Detail

# downloadActionPause
source: Pause
id: Jeda

# downloadActionResume
source: Resume
id: Lanjutkan

# downloadActionCancel
source: Cancel
id: Batalkan

# downloadActionRetry
source: Retry
id: Coba Lagi

# downloadActionConvertToPdf
source: Convert to PDF
id: Ubah ke PDF

# downloadActionDetails
source: Details
id: Detail

# downloadActionRemove
source: Remove
id: Hapus

# downloadPagesRangeFormat
source: {downloaded}/{total} (Pages {start}-{end} of {totalPages})
id: {downloaded}/{total} (Halaman {start}-{end} dari {totalPages})

# downloadContentTitle
source: Content {contentId}
id: Konten {contentId}

# downloadEtaLabel
source: ETA: {duration}
id: Perkiraan: {duration}

# downloadSettingsTitle
source: Download Settings
id: Pengaturan Download

# performanceSection
source: Performance
id: Performa

source: Max Concurrent Downloads
id: Maks Download Bersamaan

# concurrentDownloadsWarning
source: Higher values may consume more bandwidth and device resources
id: Nilai tinggi mungkin menggunakan lebih banyak bandwidth dan resource perangkat

# imageQualityLabel
source: Image Quality
id: Kualitas Gambar

# autoRetrySection
source: Auto Retry
id: Ulangi Otomatis

source: Auto Retry Failed Downloads
id: Ulangi Download Gagal Otomatis

# autoRetryDescription
source: Automatically retry failed downloads
id: Otomatis ulangi download yang gagal

source: Max Retry Attempts
id: Maks Percobaan Ulang

# networkSection
source: Network
id: Jaringan

# wifiOnlyLabel
source: WiFi Only
id: Hanya WiFi

# wifiOnlyDescription
source: Only download when connected to WiFi
id: Hanya download saat terhubung ke WiFi

# downloadTimeoutLabel
source: Download Timeout
id: Timeout Download

# notificationsSection
source: Notifications
id: Notifikasi

# enableNotificationsLabel
source: Enable Notifications
id: Aktifkan Notifikasi

# enableNotificationsDescription
source: Show notifications for download progress
id: Tampilkan notifikasi untuk progress download

# minutesUnit
source: min
id: mnt

# searchContentHint
source: Search content...
id: Cari konten...

# hideFiltersTooltip
source: Hide filters
id: Sembunyikan filter

# showMoreFiltersTooltip
source: Show more filters
id: Tampilkan lebih banyak filter

# advancedFiltersTitle
source: Advanced Filters
id: Filter Lanjutan

# sortByLabel
source: Sort by
id: Urutkan berdasarkan

# categoryLabel
source: Category
id: Kategori

# includeTagsLabel
source: Include tags (comma separated)
id: Sertakan tag (dipisahkan koma)

# includeTagsHint
source: e.g., romance, comedy, school
id: contoh: romansa, komedi, sekolah

# excludeTagsLabel
source: Exclude Tags
id: Kecualikan Tag

# excludeTagsHint
source: e.g., horror, violence
id: contoh: horor, kekerasan

# artistsHint
source: e.g., artist1, artist2
id: contoh: artis1, artis2

# pageCountRangeTitle
source: Page Count Range
id: Rentang Jumlah Halaman

# minPagesLabel
source: Min pages
id: Halaman minimal

# maxPagesLabel
source: Max pages
id: Halaman maksimal

# rangeToSeparator
source: to
id: hingga

# popularTagsTitle
source: Popular Tags
id: Tag Populer

# filtersActiveLabel
source: active
id: aktif

# clearAllFilters
source: Clear All
id: Hapus Semua

# initializingApp
source: Initializing Application...
id: Menginisialisasi Aplikasi...

# settingUpComponents
source: Setting up components and checking connection...
id: Menyiapkan komponen dan memeriksa koneksi...

# bypassingProtection
source: Bypassing protection and establishing connection...
id: Melewati proteksi dan membuat koneksi...

# selectedItemsCount
source: {count} selected
id: {count} terpilih

source: No image
id: Tidak ada gambar

# youAreOfflineShort
source: You are offline
id: Anda sedang offline

# someFeaturesLimited
source: Some features are limited. Connect to internet for full access.
id: Beberapa fitur terbatas. Sambungkan ke internet untuk akses penuh.

source: Offline Mode
id: Mode Offline

source: Apply Search
id: Terapkan Pencarian

# addFiltersToSearch
source: Add filters above to enable search
id: Tambahkan filter di atas untuk mengaktifkan pencarian

source: Start searching
id: Mulai mencari

# enterKeywordsAdvancedHint
source: Enter keywords, tags, or use advanced filters to find content
id: Masukkan kata kunci, tag, atau gunakan filter lanjutan untuk menemukan konten

source: Filters Ready
id: Filter Siap

# clearAllFiltersTooltip
source: Clear all filters
id: Bersihkan semua filter

# offlineSomeFeaturesUnavailable
source: You are offline. Some features may not be available.
id: Anda sedang offline. Beberapa fitur mungkin tidak tersedia.

source: Using downloaded content only
id: Menggunakan konten yang diunduh saja

source: Online mode with network access
id: Mode online dengan akses jaringan

# tagsScreenPlaceholder
source: Tags Screen - To be implemented
id: Layar Tag - Akan diimplementasikan

# artistsScreenPlaceholder
source: Artists Screen - To be implemented
id: Layar Artis - Akan diimplementasikan

# statusScreenPlaceholder
source: Status Screen - To be implemented
id: Layar Status - Akan diimplementasikan

source: Page Not Found
id: Halaman Tidak Ditemukan

# pageNotFoundWithUri
source: Page not found: {uri}
id: Halaman tidak ditemukan: {uri}

source: Go Home
id: Kembali ke Beranda

source: DEBUG: Theme Info
id: DEBUG: Info Tema

# lightTheme
source: Light
id: Terang

# darkTheme
source: Dark
id: Gelap

# systemMessages
source: System Messages and Background Services
id: Pesan Sistem dan Layanan Latar Belakang

source: Notification Messages
id: Pesan Notifikasi

source: Converting to PDF...
id: Mengonversi ke PDF...

# convertingToPdfWithTitle
source: Converting {title} to PDF...
id: Mengkonversi {title} ke PDF...

source: Converting to PDF ({progress}%)
id: Mengkonversi ke PDF ({progress}%)

# convertingToPdfProgressWithTitle
source: Converting {title} to PDF ({progress}%)
id: Mengkonversi {title} ke PDF ({progress}%)

source: PDF Created Successfully
id: PDF Berhasil Dibuat

# pdfCreatedWithParts
source: {title} converted to {partsCount} PDF files
id: {title} dikonversi ke {partsCount} file PDF

# pdfConversionFailed
source: PDF conversion failed for {contentId}: {error}
id: Konversi PDF gagal untuk {contentId}: {error}

# pdfConversionFailedWithError
source: PDF conversion failed for {title}: {error}
id: Konversi PDF gagal untuk {title}: {error}

# downloadingWithTitle
source: Downloading: {title}
id: Mengunduh: {title}

source: Downloading ({progress}%)
id: Mengunduh ({progress}%)

# downloadedWithTitle
source: Downloaded: {title}
id: Diunduh: {title}

# downloadFailedWithTitle
source: Failed: {title}
id: Gagal: {title}

# downloadPaused
source: Paused
id: Dijeda

# downloadResumed
source: Resumed
id: Dilanjutkan

# downloadCancelled
source: Cancelled
id: Dibatalkan

# downloadRetry
source: Retry
id: Coba Lagi

# downloadOpen
source: Open
id: Buka

# pdfOpen
source: Open PDF
id: Buka PDF

# pdfShare
source: Share
id: Bagikan

# pdfRetry
source: Retry PDF
id: Coba Lagi PDF

source: Download Service Messages
id: Pesan Layanan Unduhan

# downloadRangeInfo
source: (Pages {startPage}-{endPage})
id: (Halaman {startPage}-{endPage})

# downloadRangeComplete
source: (Pages {startPage}-{endPage})
id: (Halaman {startPage}-{endPage})

# invalidPageRange
source: Invalid page range: {start}-{end} (total: {total})
id: Rentang halaman tidak valid: {start}-{end} (total: {total})

# noDataReceived
source: No data received for image: {url}
id: Tidak ada data yang diterima untuk gambar: {url}

# createdNoMediaFile
source: Created .nomedia file for privacy: {path}
id: File .nomedia dibuat untuk privasi: {path}

# privacyProtectionEnsured
source: Privacy protection ensured for existing downloads
id: Perlindungan privasi dipastikan untuk unduhan yang ada

# pdfConversionMessages
source: PDF Conversion Service Messages
id: Pesan Layanan Konversi PDF

# pdfConversionCompleted
source: PDF conversion completed successfully for {contentId}
id: Konversi PDF berhasil diselesaikan untuk {contentId}

# pdfPartProcessing
source: Processing part {part} in isolate...
id: Memproses bagian {part} dalam isolate...

# pdfSingleProcessing
source: Processing single PDF in isolate...
id: Memproses PDF tunggal dalam isolate...

# pdfSplitRequired
source: Splitting into {totalParts} parts ({totalPages} pages)
id: Memisahkan menjadi {totalParts} bagian ({totalPages} halaman)

# pdfCreatedFiles
source: Created {partsCount} PDF file(s) with {pageCount} total pages
id: Dibuat {partsCount} file PDF dengan {pageCount} total halaman

# pdfNoImagesProvided
source: No images provided for PDF conversion
id: Tidak ada gambar yang disediakan untuk konversi PDF

# pdfFailedToCreatePart
source: Failed to create PDF part {part}: {error}
id: Gagal membuat bagian PDF {part}: {error}

# pdfFailedToCreate
source: Failed to create PDF: {error}
id: Gagal membuat PDF: {error}

# pdfOutputDirectoryCreated
source: Created PDF output directory: {path}
id: Direktori output PDF dibuat: {path}

# pdfUsingFallbackDirectory
source: Using fallback directory: {path}
id: Menggunakan direktori fallback: {path}

# pdfInfoSaved
source: PDF info saved for {contentId} ({partsCount} parts, {pageCount} pages)
id: Info PDF disimpan untuk {contentId} ({partsCount} bagian, {pageCount} halaman)

# pdfExistsForContent
source: PDF exists for {contentId}: {exists}
id: PDF ada untuk {contentId}: {exists}

# pdfFoundFiles
source: Found {count} PDF file(s) for {contentId}
id: Ditemukan {count} file PDF untuk {contentId}

# pdfDeletedFiles
source: Successfully deleted {count} PDF file(s) for {contentId}
id: Berhasil menghapus {count} file PDF untuk {contentId}

# pdfTotalSize
source: Total PDF size for {contentId}: {sizeBytes} bytes
id: Total ukuran PDF untuk {contentId}: {sizeBytes} bytes

# pdfCleanupStarted
source: Starting PDF cleanup, deleting files older than {maxAge} days
id: Memulai pembersihan PDF, menghapus file yang lebih lama dari {maxAge} hari

# pdfCleanupCompleted
source: Cleanup completed, deleted {deletedCount} old PDF files
id: Pembersihan selesai, menghapus {deletedCount} file PDF lama

# pdfStatistics
source: PDF statistics - {totalFiles} files, {totalSizeFormatted} total size, {uniqueContents} unique contents, {averageFilesPerContent} avg files per content
id: Statistik PDF - {totalFiles} file, {totalSizeFormatted} total ukuran, {uniqueContents} konten unik, {averageFilesPerContent} rata-rata file per konten

# historyCleanupMessages
source: History Cleanup Service Messages
id: Pesan Layanan Pembersihan Riwayat
