Repository: shirokun20/nhasixapp
Catalog: lib/l10n/app_*.arb
Languages: id

# appSubtitle
source: Enhanced Reading Experience
id: Pengalaman Membaca yang Ditingkatkan

source: Home
id: Beranda

source: Search
id: Cari

source: Favorites
id: Favorit

source: Downloads
id: Unduhan

# history
source: Reading History
id: Riwayat Baca

source: Random Gallery
id: Galeri Acak

source: Offline Content
id: Konten Offline

source: Settings
id: Pengaturan

source: App Disguise
id: Penyamaran Aplikasi

source: Disguise Mode
id: Mode Penyamaran

source: About
id: Tentang

# searchHint
source: Search content...
id: Cari konten...

# searchPlaceholder
source: Enter search keywords
id: Masukkan kata kunci pencarian

# noResults
source: No results found
id: Tidak ada hasil ditemukan

source: Search Suggestions
id: Saran Pencarian

source: Suggestions:
id: Saran:

source: Tap to jump
id: Ketuk untuk loncat

source: Go to Page
id: Pergi ke Halaman

# previousPageTooltip
source: Previous page
id: Halaman sebelumnya

# nextPageTooltip
source: Next page
id: Halaman berikutnya

source: Tap to jump to page
id: Ketuk untuk lompat ke halaman

source: Tap to load content
id: Ketuk untuk memuat konten

source: Connection Failed
id: Koneksi Gagal

source: Ready to Go!
id: Siap Digunakan!

# launchingApp
source: Launching main application...
id: Meluncurkan aplikasi utama...

source: Downloaded
id: Terunduh

source: Image not available
id: Gambar tidak tersedia

# loadingPage
source: Loading page {pageNumber}...
id: Memuat halaman {pageNumber}...

# checkInternetConnection
source: Check your internet connection
id: Periksa koneksi internet Anda

source: Just now
id: Baru saja

# daysAgo
source: {count}{suffix} ago
id: {count} hari{suffix} yang lalu

# hoursAgo
source: {count}{suffix} ago
id: {count} jam{suffix} yang lalu

# minutesAgo
source: {count}{suffix} ago
id: {count} menit{suffix} yang lalu

# trySwitchingNetwork
source: Try switching between WiFi and mobile data
id: Coba beralih antara WiFi dan data seluler

# restartRouter
source: Restart your router if using WiFi
id: Restart router jika menggunakan WiFi

# checkWebsiteStatus
source: Check if the website is down
id: Periksa apakah situs web sedang down

# cloudflareBypassMessage
source: The website is protected by Cloudflare. We're trying to bypass the protection.
id: Situs web dilindungi oleh Cloudflare. Kami sedang mencoba untuk melewati proteksi.

source: Force Bypass
id: Paksa Bypass

# unableToProcessData
source: Unable to process the received data. The website structure might have changed.
id: Tidak dapat memproses data yang diterima. Struktur situs mungkin telah berubah.

source: Report Issue
id: Laporkan Masalah

# serverReturnedError
source: Server returned error {statusCode}. The service might be temporarily unavailable.
id: Server mengembalikan kesalahan {statusCode}. Layanan mungkin sedang tidak tersedia.

source: Search Results
id: Hasil Pencarian

source: Failed to open browser
id: Gagal membuka browser

source: View Downloads
id: Lihat Unduhan

source: Clear Search
id: Bersihkan Pencarian

source: Clear Filters
id: Bersihkan Filter

source: Any language
id: Bahasa Apa Saja

source: Any category
id: Kategori Apa Saja

# errorOpeningFilter
source: Error opening filter selection
id: Error membuka pilihan filter

source: Error browsing tag
id: Error menjelajahi tag

source: Shuffle to next gallery
id: Acak ke galeri berikutnya

source: Content Hidden
id: Konten Disembunyikan

source: Tap to view anyway
id: Ketuk untuk tetap melihat

source: Check out this gallery!
id: Lihat galeri ini!

# galleriesPreloaded
source: {count} galleries preloaded
id: {count} galeri dimuat sebelumnya

source: Oops! Something went wrong
id: Ups! Ada yang salah

source: Cleanup Info
id: Info Pembersihan

source: Loading history
id: Memuat riwayat

source: Clearing history...
id: Menghapus riwayat...

# areYouSureClearHistory
source: Are you sure you want to clear all reading history? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus semua riwayat bacaan? Tindakan ini tidak dapat dibatalkan.

source: Try a different search term
id: Coba istilah pencarian yang berbeda

source: Unknown error
id: Error tidak diketahui

source: Loading offline content...
id: Memuat konten offline...

source: Exclude Tags
id: Kecualikan Tag

source: Exclude Groups
id: Kecualikan Grup

source: Exclude Characters
id: Kecualikan Karakter

source: Exclude Parodies
id: Kecualikan Parodi

source: Exclude Artists
id: Kecualikan Artis

source: No results found
id: Tidak ada hasil ditemukan

# tryAdjustingFilters
source: Try adjusting your search filters or search terms.
id: Coba sesuaikan filter pencarian atau istilah pencarian Anda.

source: Try different keywords
id: Coba kata kunci berbeda

# networkError
source: Network error. Please check your connection and try again.
id: Error jaringan. Silakan periksa koneksi Anda dan coba lagi.

source: Server error
id: Kesalahan server

# accessBlocked
source: Access blocked. Trying to bypass protection...
id: Akses diblokir. Mencoba melewati proteksi...

# tooManyRequests
source: Too many requests. Please wait a moment and try again.
id: Terlalu banyak permintaan. Silakan tunggu sebentar dan coba lagi.

# errorProcessingResults
source: Error processing search results. Please try again.
id: Error memproses hasil pencarian. Silakan coba lagi.

# invalidSearchParameters
source: Invalid search parameters. Please check your input.
id: Parameter pencarian tidak valid. Silakan periksa input Anda.

# unexpectedError
source: An unexpected error occurred. Please try again.
id: Terjadi error yang tidak terduga. Silakan coba lagi.

source: Retry Bypass
id: Coba Bypass Lagi

source: Retry Connection
id: Coba Koneksi Lagi

source: Retry Search
id: Coba Cari Lagi

# networkErrorTitle
source: Network Error
id: Error Jaringan

# serverErrorTitle
source: Server Error
id: Error Server

# unknownErrorTitle
source: Unknown Error
id: Error Tidak Diketahui

source: Loading content...
id: Memuat konten...

source: Refreshing content...
id: Menyegarkan konten...

source: Loading more content...
id: Memuat konten lainnya...

source: Latest Content
id: Konten Terbaru

source: No internet connection
id: Tidak ada koneksi internet

# serverTemporarilyUnavailable
source: Server is temporarily unavailable. Please try again later.
id: Server sementara tidak tersedia. Silakan coba lagi nanti.

source: Failed to load content
id: Gagal memuat konten

# cloudflareProtectionDetected
source: Cloudflare protection detected. Please wait and try again.
id: Proteksi Cloudflare terdeteksi. Silakan tunggu dan coba lagi.

# tooManyRequestsWait
source: Too many requests. Please wait a moment before trying again.
id: Terlalu banyak permintaan. Silakan tunggu sebentar sebelum mencoba lagi.

# noContentFoundMatching
source: No content found matching your search criteria. Try adjusting your filters.
id: Tidak ada konten yang ditemukan sesuai kriteria pencarian Anda. Coba sesuaikan filter Anda.

# noContentFoundForTag
source: No content found for tag "{tagName}".
id: Tidak ada konten ditemukan untuk tag "{tagName}".

source: Remove some filters
id: Hapus beberapa filter

source: Check spelling
id: Periksa ejaan

# useGeneralTerms
source: Use more general search terms
id: Gunakan istilah pencarian yang lebih umum

source: Browse popular content
id: Jelajahi konten populer

source: Try browsing other tags
id: Coba jelajahi tag lain

source: Check popular content
id: Periksa konten populer

# useSearchFunction
source: Use the search function
id: Gunakan fungsi pencarian

# checkInternetConnectionSuggestion
source: Check your internet connection
id: Periksa koneksi internet Anda

# tryRefreshingPage
source: Try refreshing the page
id: Coba muat ulang halaman

# browsePopularContentSuggestion
source: Browse popular content
id: Jelajahi konten populer

source: Failed to initialize search
id: Gagal menginisialisasi pencarian

# noResultsFoundFor
source: No results found for "{query}"
id: Tidak ada hasil ditemukan untuk "{query}"

source: Searching with filters...
id: Mencari dengan filter...

source: No results found with current filters
id: Tidak ada hasil ditemukan dengan filter saat ini

# invalidFilter
source: Invalid filter: {errors}
id: Filter tidak valid: {errors}

# invalidSearchFilter
source: Invalid search filter: {errors}
id: Filter pencarian tidak valid: {errors}

source: Pages
id: Halaman

source: Tags
id: Tag

source: Language
id: Bahasa

source: Uploaded on
id: Diunggah pada

source: Read Now
id: Baca Sekarang

source: Featured
id: Unggulan

source: Confirm Download
id: Konfirmasi Download

# downloadConfirmation
source: Are you sure you want to download?
id: Apakah Anda yakin ingin mendownload?

# confirmButton
source: Confirm
id: Konfirmasi

source: Downloading
id: Mengunduh

source: Download Completed
id: Unduhan Selesai

source: Download Failed
id: Unduhan Gagal

source: Initializing...
id: Memulai...

# noContentToBrowse
source: No content loaded to open in browser
id: Tidak ada konten untuk dibuka di browser

source: Add to Favorites
id: Tambah ke Favorit

source: Remove from Favorites
id: Hapus dari Favorit

source: Content
id: Konten

source: View
id: Lihat

source: Clear All
id: Bersihkan Semua

source: Export List
id: Ekspor Daftar

# unableToCheck
source: Unable to check connection.
id: Tidak dapat memeriksa koneksi.

source: No content available
id: Tidak ada konten tersedia

# noContentToDownload
source: No content available to download
id: Tidak ada konten untuk diunduh

# noGalleriesFound
source: No galleries found on this page
id: Tidak ada galeri ditemukan di halaman ini

# noContentLoadedToBrowse
source: No content loaded to open in browser
id: Tidak ada konten dimuat untuk dibuka di browser

source: Show Cached Content
id: Tampilkan Konten Cache

source: Opened in browser
id: Dibuka di browser

source: Found Galleries
id: Galeri Ditemukan

source: Checking Download Status...
id: Memeriksa Status Unduhan...

source: All Galleries Downloaded
id: Semua Galeri Telah Diunduh

source: Download Started
id: Unduhan Dimulai

source: Download New Galleries
id: Unduh Galeri Baru

source: Download Progress
id: Progres Unduhan

source: Download Complete
id: Unduhan Selesai

source: Download Error
id: Error Unduhan

source: Initializing downloads...
id: Memulai unduhan...

source: Loading downloads...
id: Memuat unduhan...

source: Pause All
id: Pause Semua

source: Resume All
id: Resume Semua

source: Cancel All
id: Batal Semua

source: Clear Completed
id: Bersihkan Selesai

source: Cleanup Storage
id: Bersihkan Storage

source: All
id: Semua

source: Active
id: Aktif

source: Completed
id: Selesai

source: No downloads yet
id: Belum ada unduhan

source: No active downloads
id: Tidak ada unduhan aktif

source: No queued downloads
id: Tidak ada unduhan antrian

source: No completed downloads
id: Tidak ada unduhan selesai

source: No failed downloads
id: Tidak ada unduhan gagal

# pdfConversionStarted
source: PDF conversion started for {contentId}
id: Konversi PDF dimulai untuk {contentId}

source: Cancel All Downloads
id: Batalkan Semua Unduhan

# cancelAllConfirmation
source: Are you sure you want to cancel all active downloads? This action cannot be undone.
id: Yakin ingin membatalkan semua unduhan aktif? Tindakan ini tidak bisa dibatalkan.

source: Cancel Download
id: Batalkan Unduhan

# cancelDownloadConfirmation
source: Are you sure you want to cancel this download? Progress will be lost.
id: Yakin ingin membatalkan unduhan ini? Progress akan hilang.

source: Remove Download
id: Hapus Unduhan

# removeDownloadConfirmation
source: Are you sure you want to remove this download from the list? Downloaded files will be deleted.
id: Yakin ingin menghapus unduhan ini dari daftar? File yang telah diunduh akan dihapus.

# cleanupConfirmation
source: This will remove orphaned files and clean up failed downloads. Continue?
id: Ini akan menghapus file yatim dan membersihkan unduhan yang gagal. Lanjutkan?

source: Download Details
id: Detail Unduhan

source: Speed
id: Kecepatan

source: Size
id: Ukuran

source: Started
id: Dimulai

source: Ended
id: Selesai

source: Duration
id: Durasi

source: Queued
id: Antri

source: Resume
id: Lanjutkan

source: Failed
id: Gagal

source: Download list exported
id: Daftar unduhan diekspor

source: Download All
id: Unduh Semua

source: Download Range
id: Unduh Rentang

source: Select Download Range
id: Pilih Rentang Unduhan

source: Total Pages
id: Total Halaman

source: Use slider to select range:
id: Gunakan slider untuk memilih rentang:

source: Or enter manually:
id: Atau masukkan secara manual:

source: Start Page
id: Halaman Awal

source: End Page
id: Halaman Akhir

source: Quick selections:
id: Pilihan cepat:

source: All Pages
id: Semua Halaman

source: First Half
id: Setengah Pertama

source: Second Half
id: Setengah Kedua

source: First 10
id: 10 Pertama

source: Last 10
id: 10 Terakhir

# countAlreadyDownloaded
source: Skipped {count} already downloaded
id: Dilewati {count} yang sudah diunduh

# newGalleriesToDownload
source: • {count} new galleries to download
id: • {count} galeri baru untuk didownload

# alreadyDownloaded
source: • {count} already downloaded (will be skipped)
id: • {count} sudah didownload (akan dilewati)

# downloadNew
source: Download {count} New
id: Download {count} Baru

# queuedDownloads
source: Queued {count} new downloads
id: Mengantri {count} download baru

# downloadInfo
source: Download {count} new galleries?\n\nThis may take significant time and storage space.
id: Download {count} galeri baru?\n\nIni mungkin memerlukan waktu dan ruang penyimpanan yang signifikan.

# failedToDownload
source: Failed to download galleries
id: Gagal mendownload galeri

# selectedPagesTo
source: Selected: Pages {start} to {end}
id: Dipilih: Halaman {start} hingga {end}

# pagesPercentage
source: {count} pages ({percentage}%)
id: {count} halaman ({percentage}%)

# rangeDownloadStarted
source: Range download started: {title} ({pageText})
id: Unduhan rentang dimulai: {title} ({pageText})

# opening
source: Opening: {title}
id: Membuka: {title}

# lastUpdatedLabel
source: Updated:
id: Diperbarui:

# rangeLabel
source: Range:
id: Rentang:

# ofWord
source: of
id: dari

# waitAndTry
source: Wait {minutes} minutes and try again
id: Tunggu {minutes} menit dan coba lagi

# serviceUnderMaintenance
source: The service might be under maintenance
id: Layanan mungkin sedang dalam pemeliharaan

# waitForBypass
source: Wait for automatic bypass to complete
id: Tunggu bypass otomatis selesai

# tryUsingVpn
source: Try using a VPN if available
id: Coba gunakan VPN jika tersedia

# checkBackLater
source: Check back in a few minutes
id: Periksa kembali beberapa menit lagi

# tryRefreshingContent
source: Try refreshing the content
id: Coba muat ulang konten

# checkForAppUpdate
source: Check if the app needs an update
id: Periksa apakah aplikasi perlu diperbarui

# reportIfPersists
source: Report the issue if it persists
id: Laporkan masalah jika terus berlanjut

# maintenanceTakesHours
source: Maintenance usually takes a few hours
id: Pemeliharaan biasanya memakan waktu beberapa jam

# checkSocialMedia
source: Check social media for updates
id: Periksa media sosial untuk pembaruan

source: Try again later
id: Coba lagi nanti

# serverUnavailable
source: The server is currently unavailable. Please try again later.
id: Server saat ini tidak tersedia. Silakan coba lagi nanti.

source: Use broader search terms
id: Gunakan istilah pencarian yang lebih luas

source: Loading favorites...
id: Memuat favorit...

source: Error Loading Favorites
id: Error Memuat Favorit

source: Remove Favorite
id: Hapus Favorit

# removeFavoriteConfirmation
source: Are you sure you want to remove this content from favorites?
id: Yakin ingin menghapus konten ini dari favorit?

# removeAction
source: Remove
id: Hapus

source: Delete Favorites
id: Hapus Favorit

# deleteFavoritesConfirmation
source: Are you sure you want to remove {count} favorite{s}?
id: Yakin ingin menghapus {count} favorit{s}?

source: Export Favorites
id: Ekspor Favorit

# noFavoritesYet
source: No favorites yet. Start adding content to your favorites!
id: Belum ada favorit. Mulai tambahkan konten ke favorit Anda!

source: Exporting favorites...
id: Mengekspor favorit...

source: Export Complete
id: Ekspor Selesai

# exportedFavoritesCount
source: Exported {count} favorites successfully.
id: Berhasil mengekspor {count} favorit.

# exportFailed
source: Export Failed: {error}
id: Ekspor Gagal: {error}

# selectedCount
source: {count} selected
id: {count} dipilih

source: Select favorites
id: Pilih favorit

# exportAction
source: Export
id: Ekspor

# refreshAction
source: Refresh
id: Segarkan

source: Delete selected
id: Hapus yang dipilih

source: Search favorites...
id: Cari favorit...

source: Select All
id: Pilih Semua

# clearSelection
source: Clear
id: Bersihkan

source: Removing from favorites...
id: Menghapus dari favorit...

source: Removed from favorites
id: Dihapus dari favorit

# failedToRemoveFavorite
source: Failed to remove favorite: {error}
id: Gagal menghapus favorit: {error}

# removedFavoritesCount
source: Removed {count} favorites
id: Menghapus {count} favorit

# failedToRemoveFavorites
source: Failed to remove favorites: {error}
id: Gagal menghapus favorit: {error}

source: Appearance
id: Tampilan

source: Theme
id: Tema

source: Image Quality
id: Kualitas Gambar

source: Blur Thumbnails
id: Blur Thumbnail

# blurThumbnailsDescription
source: Apply blur effect on card images for privacy
id: Terapkan efek blur pada gambar kartu untuk privasi

# gridColumns
source: Grid Columns (Portrait)
id: Kolom Grid (Portrait)

source: Reader
id: Pembaca

source: Show System UI in Reader
id: Tampilkan UI Sistem di Pembaca

source: History Cleanup
id: Pembersihan Riwayat

source: Auto Cleanup History
id: Pembersihan Otomatis Riwayat

source: Automatically clean old reading history
id: Otomatis membersihkan riwayat baca lama

source: Cleanup Interval
id: Interval Pembersihan

source: How often to cleanup history
id: Seberapa sering membersihkan riwayat

source: Max History Days
id: Maksimal Hari Riwayat

# maximumDaysToKeepHistory
source: Maximum days to keep history (0 = unlimited)
id: Maksimal hari menyimpan riwayat (0 = tanpa batas)

source: Cleanup on Inactivity
id: Bersihkan saat Tidak Aktif

# cleanHistoryWhenAppUnused
source: Clean history when app is unused for several days
id: Bersihkan riwayat ketika aplikasi tidak digunakan beberapa hari

source: Inactivity Threshold
id: Batas Tidak Aktif

source: Days of inactivity before cleanup
id: Hari tidak aktif sebelum pembersihan

source: Reset to Default
id: Reset ke Default

source: Reset to Defaults
id: Reset ke Default

source: General Settings
id: Pengaturan Umum

# displaySettings
source: Display
id: Tampilan

source: Dark Mode
id: Mode Gelap

source: Light Mode
id: Mode Terang

# systemMode
source: Follow System
id: Mengikuti Sistem

source: App Language
id: Bahasa Aplikasi

source: Allow Analytics
id: Izinkan Analytics

source: Privacy Analytics
id: Privasi Analytics

source: Terms and Conditions
id: Syarat dan Ketentuan

# termsAndConditionsSubtitle
source: User agreement and disclaimers
id: Perjanjian pengguna dan disclaimer

source: Privacy Policy
id: Kebijakan Privasi

# privacyPolicySubtitle
source: How we handle your data
id: Bagaimana kami menangani data Anda

# faqSubtitle
source: Frequently asked questions
id: Pertanyaan yang sering diajukan

source: Reset Settings
id: Reset Pengaturan

source: Reset Reader Settings
id: Reset Pengaturan Reader

# resetReaderSettingsConfirmation
source: This will reset all reader settings to their default values:
id: Ini akan mengatur ulang semua pengaturan pembaca ke nilai default:

# readingModeLabel
source: Reading Mode: Horizontal Pages
id: Mode Membaca: Halaman Horizontal

# keepScreenOnLabel
source: Keep Screen On: Off
id: Jaga Layar Hidup: Mati

# showUILabel
source: Show UI: On
id: Tampilkan UI: Hidup

# areYouSure
source: Are you sure you want to proceed?
id: Apakah Anda yakin ingin melanjutkan?

# readerSettingsResetSuccess
source: Reader settings have been reset to defaults.
id: Pengaturan pembaca telah direset ke default.

# failedToResetSettings
source: Failed to reset settings: {error}
id: Gagal mereset pengaturan: {error}

source: Reading History
id: Riwayat Baca

source: Clear All History
id: Bersihkan Semua Riwayat

source: Manual Cleanup
id: Pembersihan Manual

source: Cleanup Settings
id: Pengaturan Pembersihan

source: Remove from History
id: Hapus dari Riwayat

# removeFromHistoryQuestion
source: Remove this item from reading history?
id: Hapus item ini dari riwayat baca?

source: Cleanup
id: Bersihkan

source: Failed to load cleanup status
id: Gagal memuat status pembersihan

# manualCleanupConfirmation
source: This will perform cleanup based on your current settings. Continue?
id: Ini akan melakukan pembersihan berdasarkan pengaturan Anda saat ini. Lanjutkan?

source: No Reading History
id: Tidak Ada Riwayat Baca

source: Error Loading History
id: Error Memuat Riwayat

source: Next Page
id: Halaman Berikutnya

source: Previous Page
id: Halaman Sebelumnya

# pageOf
source: of
id: dari

source: Fullscreen
id: Layar Penuh

source: Exit Fullscreen
id: Keluar Layar Penuh

source: Checking connection...
id: Memeriksa koneksi...

# backOnline
source: Back online! All features available.
id: Kembali online! Semua fitur tersedia.

# stillNoInternet
source: Still no internet connection.
id: Masih tidak ada koneksi internet.

source: Unable to check connection.
id: Tidak dapat memeriksa koneksi.

source: Connection error
id: Kesalahan koneksi

source: Low
id: Rendah

source: Medium
id: Sedang

source: High
id: Tinggi

source: Original
id: Asli

source: Low (Faster)
id: Rendah (Lebih Cepat)

source: High (Better Quality)
id: Tinggi (Kualitas Lebih Baik)

source: Original (Largest)
id: Asli (Terbesar)

# lowQuality
source: Low (Faster)
id: Rendah (Lebih Cepat)

# mediumQuality
source: Medium
id: Sedang

# highQuality
source: High (Better Quality)
id: Tinggi (Kualitas Lebih Baik)

# originalQuality
source: Original (Largest)
id: Asli (Terbesar)

source: Dark
id: Gelap

source: Light
id: Terang

source: English
id: Bahasa Inggris

source: Japanese
id: Bahasa Jepang

source: Indonesian
id: Bahasa Indonesia

source: Sort by
id: Urutkan berdasarkan

source: Filter by
id: Filter berdasarkan

source: Recent
id: Terbaru

source: Popular
id: Populer

source: Oldest
id: Terlama

source: Cancel
id: Batalkan

source: Delete
id: Hapus

source: Confirm
id: Konfirmasi

source: Loading...
id: Memuat...

source: Retry
id: Coba Lagi

source: Try Again
id: Coba Lagi

source: Save
id: Simpan

source: Close
id: Tutup

source: Clear
id: Bersihkan

source: Remove
id: Hapus

source: Share
id: Bagikan

source: Go Back
id: Kembali

source: Yes
id: Ya

source: No
id: Tidak

source: Previous
id: Sebelumnya

source: Next
id: Selanjutnya

source: Go to Downloads
id: Ke Unduhan

# retryAction
source: Retry
id: Coba Lagi

# hours
source: {count}h
id: {count}j

# days
source: {count} days
id: {count} hari

source: Unknown
id: Tidak diketahui

source: No Data
id: Tidak Ada Data

source: Unknown Title
id: Judul Tidak Diketahui

source: Offline Content Error
id: Error Konten Offline

source: Other
id: Lainnya

# confirmResetSettings
source: Are you sure you want to restore all settings to default?
id: Yakin ingin mengembalikan semua pengaturan ke default?

# manageAutoCleanupDescription
source: Manage automatic cleanup of reading history to free up storage space.
id: Kelola pembersihan otomatis riwayat baca untuk menghemat ruang penyimpanan.

source: Next cleanup
id: Pembersihan berikutnya

source: History Statistics
id: Statistik Riwayat

source: Total items
id: Total item

source: Last cleanup
id: Pembersihan terakhir

source: Last app access
id: Akses aplikasi terakhir
